microchip-pic-avr-examples/dspic33e-code-examples/dspic33e-ecan-rtr/firmware/src/system_config/exp16/dspic33ep512mu810/main.c
// CAN Messages in RAM
mID                             rx_ecan1message;
mID                             rx_ecan2message;

// *****************************************************************************
// Section: Static Function declaration
// *****************************************************************************
void                            OscConfig( void );
void                            ClearIntrflags( void );
void                            Ecan1WriteMessage( void );
void                            Ecan2WriteMessage( void );

// *****************************************************************************
// Section: Function definition
// *****************************************************************************

/******************************************************************************
 * Function:        int main(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Sets CPU clock and initializes CAN1 and CAN2.
 *****************************************************************************/
#ifdef TEST_MODE
unsigned char test_flag;
#endif
#ifdef TEST_MODE
int ce_main(void)
#else
int main(void)
#endif
{

#ifdef TEST_MODE
    test_flag= 0;
#endif

    /* Configure Oscillator Clock Source     */
    OscConfig();

    /* Clear Interrupt Flags                 */
    ClearIntrflags();

    /* ECAN1 Initialisation         
   Configure DMA Channel 0 for ECAN1 Transmit (Remote Transmit Request)
   Configure DMA Channel 2 for ECAN1 Receive  (Remote Data Reception) */
    Ecan1Init();
    DMA0Init();
    DMA2Init();

    /* Enable ECAN1 Interrupt */
    IEC2bits.C1IE = 1;
    C1INTEbits.TBIE = 1;
    C1INTEbits.RBIE = 1;

    /* ECAN2 Initialisation         
   Configure DMA Channel 1 for ECAN2 Transmit (Remote Transmit Response)
   Enable Automatice Response to Remote Frame using Message Buffer 0 */
    Ecan2Init();
    DMA1Init();
    C2TR01CONbits.RTREN0 = 1;

    /* Enable ECAN2 Interrupt */
    IEC3bits.C2IE = 1;
    C2INTEbits.TBIE = 1;
    C2INTEbits.RBIE = 1;

    /* Write a Message in ECAN2 Transmit Buffer
   This message is automatically transmitted in response to RTR    */
    Ecan2WriteMessage();

    /* Write a Remote Request Message in ECAN1 Transmit Buffer    
   Request Remote Reuest Frame Transmission    */
    Ecan1WriteMessage();
    C1TR01CONbits.TXREQ0 = 1;

   #ifdef TEST_MODE
    while(1)
    {
        if (
            (ecan1msgBuf[1][3] == 0x1111) &&
            (ecan1msgBuf[1][4] == 0x2222) &&
            (ecan1msgBuf[1][5] == 0x3333) &&
            (ecan1msgBuf[1][6] == 0x4444)

         )
            test_flag = 1;
        else
            test_flag = 0;

        if(test_flag == 1)
            return 0;
    }
#else
    /* Loop infinitely */
    while( 1 );
#endif

}

/******************************************************************************
 * Function:        void Ecan1WriteMessage(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is used to write the ECAN1 buffer with the
 *                  identifiers and the data. Writes the message to be
 *                  transmitted.
 *****************************************************************************/
void Ecan1WriteMessage( void )
{
    /* Writing the message for Transmission
Ecan1WriteTxMsgBufId(unsigned int buf, long txIdentifier, unsigned int ide, unsigned int remoteTransmit);
Ecan1WriteTxMsgBufData(unsigned int buf, unsigned int dataLength, unsigned int data1, unsigned int data2, unsigned int data3, unsigned int data4);

buf -> Transmit Buffer number

txIdentifier -> SID<10:0> : EID<17:0>

ide = 0 -> Message will transmit standard identifier
ide = 1 -> Message will transmit extended identifier

remoteTransmit = 0 -> Normal message
remoteTransmit = 1 -> Message will request remote transmission

dataLength -> Data length can be from 0 to 8 bytes

data1, data2, data3, data4 -> Data words (2 bytes) each
For Remote Transmit Request (RTR), no data needs to be transmitted.
Some dummy values may be written into the data arguments of the ecan1WriteTxMsgBufData() function.


*/
    Ecan1WriteTxMsgBufId( 0, 0x1FFEFFFF, 1, 1 );
    Ecan1WriteTxMsgBufData( 0, 8, 0, 0, 0, 0 );
}

/******************************************************************************
 * Function:        void Ecan2WriteMessage(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is used to write the ECAN2 buffer with the
 *                  identifiers and the data. Writes the message to be
 *                  transmitted.
 *****************************************************************************/
void Ecan2WriteMessage( void )
{
    /* Writing the message for Transmission

Ecan2WriteTxMsgBufId(unsigned int16_t buf, long txIdentifier, unsigned int16_t ide, unsigned int16_t remoteTransmit);
Ecan2WriteTxMsgBufData(unsigned int16_t buf, unsigned int16_t dataLength, unsigned int16_t data1, unsigned int16_t data2, unsigned int16_t data3, unsigned int16_t data4);

buf -> Transmit Buffer Number

txIdentifier -> SID<10:0> : EID<17:0>

ide = 0 -> Message will transmit standard identifier
ide = 1 -> Message will transmit extended identifier

remoteTransmit = 0 -> Normal message
remoteTransmit = 1 -> Message will request remote transmission


dataLength -> Data length can be from 0 to 8 bytes

data1, data2, data3, data4 -> Data words (2 bytes) each


*/
    Ecan2WriteTxMsgBufId( 0, 0x1FFEFFFF, 1, 0 );
    Ecan2WriteTxMsgBufData( 0, 8, 0x1111, 0x2222, 0x3333, 0x4444 );
}

/******************************************************************************
 * Function:        void RxECAN1(mID *message)
 *
 * PreCondition:    None
 *
 * Input:          *message: a pointer to the message structure in RAM
 *                  that will store the message.
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Moves the message from the DMA memory to RAM.
 *****************************************************************************/
void RxECAN1( mID *message )
{
    uint16_t    ide = 0;
    uint16_t    srr = 0;
    uint32_t    id = 0;

